var rule = {
    title: '[优]柠檬影视',
    host: 'http://m.te0066.com.cn/',
    //parse_url: 'https://player.mqtv.cc/fun/?url=',
    url: 'show/fyfilter.html',
    searchUrl: '/search/wd=**',
    //detailUrl:'/libs/VodInfo.api.php?ctid=fyid',
    searchable: 2,
    quickSearch: 0,
    filterable: 1,
    filter:  {
    "1":[
      {
        "key":"分类", "name":"分类", "value":[
          {"n":"全部","v":"1"},{"n":"动作片","v":"7"},
          {"n":"喜剧片","v":"8"},{"n":"爱情片","v":"9"},
          {"n":"科幻片","v":"10"},{"n":"恐怖片","v":"11"},
          {"n":"剧情片","v":"12"},{"n":"犯罪片","v":"29"},
          {"n":"战争片","v":"13"}
        ]
      },
      {
        "key":"剧情", "name":"剧情", "value":[
          {"n":"全部","v":""},{"n":"喜剧","v":"喜剧"},
          {"n":"爱情","v":"爱情"},{"n":"恐怖","v":"恐怖"},
          {"n":"动作","v":"动作"},{"n":"科幻","v":"科幻"},
          {"n":"剧情","v":"剧情"},{"n":"战争","v":"战争"},
          {"n":"警匪","v":"警匪"},{"n":"犯罪","v":"犯罪"},
          {"n":"动画","v":"动画"},{"n":"奇幻","v":"奇幻"},
          {"n":"武侠","v":"武侠"},{"n":"冒险","v":"冒险"},
          {"n":"枪战","v":"枪战"},{"n":"恐怖","v":"恐怖"},
          {"n":"悬疑","v":"悬疑"},{"n":"惊悚","v":"惊悚"},
          {"n":"经典","v":"经典"},{"n":"青春","v":"青春"},
          {"n":"文艺","v":"文艺"},{"n":"微电影","v":"微电影"},
          {"n":"古装","v":"古装"},{"n":"历史","v":"历史"},
          {"n":"运动","v":"运动"},{"n":"农村","v":"农村"},
          {"n":"儿童","v":"儿童"},{"n":"网络电影","v":"网络电影"}
        ]
      },
      {
        "key":"地区", "name":"地区", "value":[
          {"n":"全部","v":""},{"n":"大陆","v":"大陆"},
          {"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},
          {"n":"美国","v":"美国"},{"n":"法国","v":"法国"},
          {"n":"英国","v":"英国"},{"n":"日本","v":"日本"},
          {"n":"韩国","v":"韩国"},{"n":"德国","v":"德国"},
          {"n":"泰国","v":"泰国"},{"n":"印度","v":"印度"},
          {"n":"意大利","v":"意大利"},
          {"n":"加拿大","v":"加拿大"},
          {"n":"其他","v":"其他"}
        ]
      },
      {
        "key":"字母", "name":"字幕", "value":[
          {"n":"全部","v":""},{"n":"A","v":"A"},
          {"n":"B","v":"B"},{"n":"C","v":"C"},
          {"n":"D","v":"D"},{"n":"E","v":"E"},
          {"n":"F","v":"F"},{"n":"G","v":"G"},
          {"n":"H","v":"H"},{"n":"I","v":"I"},
          {"n":"J","v":"J"},{"n":"K","v":"K"},
          {"n":"L","v":"L"},{"n":"M","v":"M"},
          {"n":"N","v":"N"},{"n":"O","v":"O"},
          {"n":"P","v":"P"},{"n":"Q","v":"Q"},
          {"n":"R","v":"R"},{"n":"S","v":"S"},
          {"n":"T","v":"T"},{"n":"U","v":"U"},
          {"n":"V","v":"V"},{"n":"W","v":"W"},
          {"n":"X","v":"X"},{"n":"Y","v":"Y"},
          {"n":"Z","v":"Z"}
        ]
      }
    ],
    "2":[
      {
        "key":"分类", "name":"分类", "value":[
          {"n":"全部","v":"2"},
          {"n":"国产剧","v":"14"},
          {"n":"香港剧","v":"15"},
          {"n":"台湾剧","v":"16"},
          {"n":"韩国剧","v":"17"},
          {"n":"日本剧","v":"18"},
          {"n":"泰国剧","v":"31"},
          {"n":"欧美剧","v":"198"},
          {"n":"海外剧","v":"20"}
        ]
      },
      {
        "key":"剧情", "name":"剧情", "value":[
          {"n":"全部","v":""},{"n":"古装","v":"古装"},
          {"n":"战争","v":"战争"},{"n":"青春偶像","v":"青春偶像"},
          {"n":"喜剧","v":"喜剧"},{"n":"家庭","v":"家庭"},
          {"n":"爱情","v":"爱情"},{"n":"恐怖","v":"恐怖"},
          {"n":"动作","v":"动作"},{"n":"科幻","v":"科幻"},
          {"n":"剧情","v":"剧情"},{"n":"战争","v":"战争"},
          {"n":"奇幻","v":"奇幻"},{"n":"犯罪","v":"犯罪"},
          {"n":"历史","v":"历史"},{"n":"经典","v":"经典"},
          {"n":"运动","v":"运动"},{"n":"乡村","v":"乡村"},
          {"n":"情景","v":"情景"},{"n":"商战","v":"商战"},
          {"n":"网剧","v":"网剧"},{"n":"其他","v":"其他"}
        ]
      },
      {
        "key":"地区", "name":"地区", "value":[
          {"n":"全部","v":""},{"n":"内地","v":"内地"},
          {"n":"韩国","v":"韩国"},{"n":"香港","v":"香港"},
          {"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},
          {"n":"英国","v":"英国"},{"n":"日本","v":"日本"},
          {"n":"泰国","v":"泰国"},{"n":"新加坡","v":"新加坡"},
          {"n":"其他","v":"其他"}
        ]
      },
      {
        "key":"字母", "name":"字幕", "value":[
          {"n":"全部","v":""},{"n":"A","v":"A"},
          {"n":"B","v":"B"},{"n":"C","v":"C"},
          {"n":"D","v":"D"},{"n":"E","v":"E"},
          {"n":"F","v":"F"},{"n":"G","v":"G"},
          {"n":"H","v":"H"},{"n":"I","v":"I"},
          {"n":"J","v":"J"},{"n":"K","v":"K"},
          {"n":"L","v":"L"},{"n":"M","v":"M"},
          {"n":"N","v":"N"},{"n":"O","v":"O"},
          {"n":"P","v":"P"},{"n":"Q","v":"Q"},
          {"n":"R","v":"R"},{"n":"S","v":"S"},
          {"n":"T","v":"T"},{"n":"U","v":"U"},
          {"n":"V","v":"V"},{"n":"W","v":"W"},
          {"n":"X","v":"X"},{"n":"Y","v":"Y"},
          {"n":"Z","v":"Z"}
        ]
      }
    ],
    "3":[
      {
        "key":"分类", "name":"分类", "value":[
          {"n":"全部","v":"3"},
          {"n":"大陆综艺","v":"21"},
          {"n":"港台综艺","v":"22"},
          {"n":"日韩综艺","v":"23"},
          {"n":"欧美综艺","v":"24"}
        ]
      },      
      {
        "key":"剧情", "name":"剧情", "value":[
          {"n":"全部","v":""},{"n":"选秀","v":"选秀"},
          {"n":"情感","v":"情感"},{"n":"访谈","v":"访谈"},
          {"n":"播报","v":"播报"},{"n":"旅游","v":"旅游"},
          {"n":"音乐","v":"音乐"},{"n":"美食","v":"美食"},
          {"n":"纪实","v":"纪实"},{"n":"曲艺","v":"曲艺"},
          {"n":"生活","v":"生活"},{"n":"游戏互动","v":"游戏互动"},
          {"n":"财经","v":"财经"},{"n":"求职","v":"求职"}
        ]
      },
      {
        "key":"地区", "name":"地区", "value":[
          {"n":"全部","v":""},{"n":"内地","v":"内地"},
          {"n":"港台","v":"港台"},{"n":"日韩","v":"日韩"},
          {"n":"台湾","v":"欧美"}
        ]
      },
      {
        "key":"字母", "name":"字幕", "value":[
          {"n":"全部","v":""},{"n":"A","v":"A"},
          {"n":"B","v":"B"},{"n":"C","v":"C"},
          {"n":"D","v":"D"},{"n":"E","v":"E"},
          {"n":"F","v":"F"},{"n":"G","v":"G"},
          {"n":"H","v":"H"},{"n":"I","v":"I"},
          {"n":"J","v":"J"},{"n":"K","v":"K"},
          {"n":"L","v":"L"},{"n":"M","v":"M"},
          {"n":"N","v":"N"},{"n":"O","v":"O"},
          {"n":"P","v":"P"},{"n":"Q","v":"Q"},
          {"n":"R","v":"R"},{"n":"S","v":"S"},
          {"n":"T","v":"T"},{"n":"U","v":"U"},
          {"n":"V","v":"V"},{"n":"W","v":"W"},
          {"n":"X","v":"X"},{"n":"Y","v":"Y"},
          {"n":"Z","v":"Z"}
        ]
      }
    ],
    "4":[
      {
        "key":"分类", "name":"分类", "value":[
          {"n":"全部","v":"4"},
          {"n":"国产动漫","v":"25"},
          {"n":"日本动漫","v":"26"},
          {"n":"欧美动漫","v":"27"},
          {"n":"海外动漫","v":"28"},
        ]
      },
      {
        "key":"字母", "name":"字幕", "value":[
          {"n":"全部","v":""},{"n":"A","v":"A"},
          {"n":"B","v":"B"},{"n":"C","v":"C"},
          {"n":"D","v":"D"},{"n":"E","v":"E"},
          {"n":"F","v":"F"},{"n":"G","v":"G"},
          {"n":"H","v":"H"},{"n":"I","v":"I"},
          {"n":"J","v":"J"},{"n":"K","v":"K"},
          {"n":"L","v":"L"},{"n":"M","v":"M"},
          {"n":"N","v":"N"},{"n":"O","v":"O"},
          {"n":"P","v":"P"},{"n":"Q","v":"Q"},
          {"n":"R","v":"R"},{"n":"S","v":"S"},
          {"n":"T","v":"T"},{"n":"U","v":"U"},
          {"n":"V","v":"V"},{"n":"W","v":"W"},
          {"n":"X","v":"X"},{"n":"Y","v":"Y"},
          {"n":"Z","v":"Z"}
        ]
      }
    ],
    "30":[
      {
        "key":"分类", "name":"分类", "value":[
          {"n":"全部","v":"30"}
        ]
      },
      {
        "key":"字母", "name":"字幕", "value":[
          {"n":"全部","v":""},{"n":"A","v":"A"},
          {"n":"B","v":"B"},{"n":"C","v":"C"},
          {"n":"D","v":"D"},{"n":"E","v":"E"},
          {"n":"F","v":"F"},{"n":"G","v":"G"},
          {"n":"H","v":"H"},{"n":"I","v":"I"},
          {"n":"J","v":"J"},{"n":"K","v":"K"},
          {"n":"L","v":"L"},{"n":"M","v":"M"},
          {"n":"N","v":"N"},{"n":"O","v":"O"},
          {"n":"P","v":"P"},{"n":"Q","v":"Q"},
          {"n":"R","v":"R"},{"n":"S","v":"S"},
          {"n":"T","v":"T"},{"n":"U","v":"U"},
          {"n":"V","v":"V"},{"n":"W","v":"W"},
          {"n":"X","v":"X"},{"n":"Y","v":"Y"},
          {"n":"Z","v":"Z"}
        ]
      }
    ],
    "36":[
      {
        "key":"分类", "name":"分类", "value":[
          {"n":"全部","v":"36"}
        ]
      },
      {
        "key":"字母", "name":"字幕", "value":[
          {"n":"全部","v":""},{"n":"A","v":"A"},
          {"n":"B","v":"B"},{"n":"C","v":"C"},
          {"n":"D","v":"D"},{"n":"E","v":"E"},
          {"n":"F","v":"F"},{"n":"G","v":"G"},
          {"n":"H","v":"H"},{"n":"I","v":"I"},
          {"n":"J","v":"J"},{"n":"K","v":"K"},
          {"n":"L","v":"L"},{"n":"M","v":"M"},
          {"n":"N","v":"N"},{"n":"O","v":"O"},
          {"n":"P","v":"P"},{"n":"Q","v":"Q"},
          {"n":"R","v":"R"},{"n":"S","v":"S"},
          {"n":"T","v":"T"},{"n":"U","v":"U"},
          {"n":"V","v":"V"},{"n":"W","v":"W"},
          {"n":"X","v":"X"},{"n":"Y","v":"Y"},
          {"n":"Z","v":"Z"}
        ]
      }
    ]
    },
    filter_url: '/{{fl.分类}}-{{fl.地区}}--{{fl.剧情}}--{{fl.字母}}---fypage---',
    filter_def: {},
    headers: {
        'User-Agent': 'PC_UA',
    },
    timeout: 5000,
    class_name: '电影&电视剧&综艺&动漫&短剧屋&主题伦理',
    class_url: '1&2&3&4&30&36',
    cate_exclude: '',
    play_parse: true,
    //is_video: 'obj/tos',
    lazy: $js.toString(() => {
       let html = request(input);  
       let player = jsp.pdfh(html,"a.btn-primary&&href").replace('}', '');
       log(player);
       if (player.length > 0){
           input = HOST+player;
       };
       let html1 = request(input);
       let hconf = html1.match(/r player_.*?=(.*?)</)[1];
       let json = JSON5.parse(hconf);
       let url = json.url;
       if (json.encrypt == '1') {
        url = unescape(url);
        } else if (json.encrypt == '2') {
          url = unescape(base64Decode(url));
          }
       if (/.(m3u8|mp4|m4a|mp3)/.test(url)) {
          input = {
            parse: 0,
            jx: 0,
            url: url,
            };
          } else {
            input;
          }
    }),
    double: true,
    推荐: '',
    /*预处理: $js.toString(() => {
        let xrequest = request;
        (function() {
            request = function(url, obj) {
                function setCookie() {
                    let {
                        cookie
                    } = reqCookie(HOST);
                    rule.headers["cookie"] = cookie;
                    return rule.headers;
                }
                let result = xrequest(url, obj);
                if (result == "") {
                    result = xrequest(url, {
                        headers: setCookie()
                    });
                }
                return result;
            }
        })()
    }),*/
    一级: '.ewave-vodlist&&li;h4&&Text;.lazyload&&data-original;.pic-text&&Text;a&&href',
    二级:{
        title: 'h1&&Text',
        img: '#Cover&&img&&src',
        desc: '.sub_r&&p,-1&&Text',
        content: '.txtDesc&&Text',
        tabs: '.nav-tabs&&li&&a',
        lists: 'ul.ewave-content__playlist&&li',
    },
    搜索: 'ul.ewave-content__playlist&&li;a&&Text;.lazyload&&src;;a&&href;desc',
}
