var rule = {
  类型: '影视',//影视|听书|漫画|小说
  title: '看一看',
  host: 'https://www.kyktv1.cc',
  url: '/index.php?fyfilter.html',
  searchUrl: '/index.php?m=vod-search-pg-fypage-wd-**.html',
  searchable: 2,
  quickSearch: 0,
  filterable: 1,
  filter: {
    "dianying": [
      { "key": "分类", "name": "分类", "value": [{ "n": "全部", "v": "1" }, { "n": "动作片", "v": "5" }, { "n": "喜剧片", "v": "6" }, { "n": "爱情片", "v": "7" }, { "n": "科幻片", "v": "8" }, { "n": "恐怖片", "v": "9" }, { "n": "剧情片", "v": "10" }, { "n": "战争片", "v": "11" }, { "n": "纪录片", "v": "16" }, { "n": "微电影", "v": "18" }, { "n": "惊悚片", "v": "20" }, { "n": "悬疑片", "v": "21" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "全部", "v": "" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "2008", "v": "2008" }, { "n": "2007", "v": "2007" }, { "n": "2006", "v": "2006" }, { "n": "2005", "v": "2005" }, { "n": "2004", "v": "2004" }, { "n": "2003", "v": "2003" }, { "n": "2002", "v": "2002" }, { "n": "2001", "v": "2001" }, { "n": "2000", "v": "2000" }, { "n": "1999", "v": "1999" }, { "n": "1998", "v": "1998" }, { "n": "1997", "v": "1997" }, { "n": "1996", "v": "1996" }, { "n": "1995", "v": "1995" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "全部", "v": "" }, { "n": "大陆", "v": "大陆" }, { "n": "香港", "v": "香港" }, { "n": "台湾", "v": "台湾" }, { "n": "美国", "v": "美国" }, { "n": "韩国", "v": "韩国" }, { "n": "日本", "v": "日本" }, { "n": "泰国", "v": "泰国" }, { "n": "新加坡", "v": "新加坡" }, { "n": "马来西亚", "v": "马来西亚" }, { "n": "印度", "v": "印度" }, { "n": "英国", "v": "英国" }, { "n": "法国", "v": "法国" }, { "n": "加拿大", "v": "加拿大" }, { "n": "西班牙", "v": "西班牙" }, { "n": "俄罗斯", "v": "俄罗斯" }, { "n": "其它", "v": "其它" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "最新", "v": "time" }, { "n": "人气", "v": "hits" }, { "n": "推荐", "v": "score" }] }],
    "lianxuju": [
      { "key": "分类", "name": "分类", "value": [{ "n": "国产剧", "v": "12" }, { "n": "港台剧", "v": "13" }, { "n": "日韩剧", "v": "14" }, { "n": "欧美剧", "v": "15" }, { "n": "泰剧", "v": "19" }, { "n": "海外剧", "v": "32" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "2008", "v": "2008" }, { "n": "2007", "v": "2007" }, { "n": "2006", "v": "2006" }, { "n": "2005", "v": "2005" }, { "n": "2004", "v": "2004" }, { "n": "2003", "v": "2003" }, { "n": "2002", "v": "2002" }, { "n": "2001", "v": "2001" }, { "n": "2000", "v": "2000" }, { "n": "1999", "v": "1999" }, { "n": "1998", "v": "1998" }, { "n": "1997", "v": "1997" }, { "n": "1996", "v": "1996" }, { "n": "1995", "v": "1995" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "大陆", "v": "大陆" }, { "n": "香港", "v": "香港" }, { "n": "台湾", "v": "台湾" }, { "n": "美国", "v": "美国" }, { "n": "韩国", "v": "韩国" }, { "n": "日本", "v": "日本" }, { "n": "泰国", "v": "泰国" }, { "n": "新加坡", "v": "新加坡" }, { "n": "马来西亚", "v": "马来西亚" }, { "n": "印度", "v": "印度" }, { "n": "英国", "v": "英国" }, { "n": "法国", "v": "法国" }, { "n": "加拿大", "v": "加拿大" }, { "n": "西班牙", "v": "西班牙" }, { "n": "俄罗斯", "v": "俄罗斯" }, { "n": "其它", "v": "其它" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "最新", "v": "time" }, { "n": "人气", "v": "hits" }, { "n": "推荐", "v": "score" }] }],
    "dongman": [
      { "key": "分类", "name": "分类", "value": [{ "n": "TV版", "v": "23" }, { "n": "电影版", "v": "24" }, { "n": "剧场版", "v": "25" }, { "n": "国语经典", "v": "36" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "2008", "v": "2008" }, { "n": "2007", "v": "2007" }, { "n": "2006", "v": "2006" }, { "n": "2005", "v": "2005" }, { "n": "2004", "v": "2004" }, { "n": "2003", "v": "2003" }, { "n": "2002", "v": "2002" }, { "n": "2001", "v": "2001" }, { "n": "2000", "v": "2000" }, { "n": "1999", "v": "1999" }, { "n": "1998", "v": "1998" }, { "n": "1997", "v": "1997" }, { "n": "1996", "v": "1996" }, { "n": "1995", "v": "1995" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "大陆", "v": "大陆" }, { "n": "香港", "v": "香港" }, { "n": "台湾", "v": "台湾" }, { "n": "美国", "v": "美国" }, { "n": "韩国", "v": "韩国" }, { "n": "日本", "v": "日本" }, { "n": "泰国", "v": "泰国" }, { "n": "新加坡", "v": "新加坡" }, { "n": "马来西亚", "v": "马来西亚" }, { "n": "印度", "v": "印度" }, { "n": "英国", "v": "英国" }, { "n": "法国", "v": "法国" }, { "n": "加拿大", "v": "加拿大" }, { "n": "西班牙", "v": "西班牙" }, { "n": "俄罗斯", "v": "俄罗斯" }, { "n": "其它", "v": "其它" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "最新", "v": "time" }, { "n": "人气", "v": "hits" }, { "n": "推荐", "v": "score" }] }],
    "zongyi": [
      { "key": "分类", "name": "分类", "value": [{ "n": "TV综艺", "v": "26" }, { "n": "音乐MV", "v": "31" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "2008", "v": "2008" }, { "n": "2007", "v": "2007" }, { "n": "2006", "v": "2006" }, { "n": "2005", "v": "2005" }, { "n": "2004", "v": "2004" }, { "n": "2003", "v": "2003" }, { "n": "2002", "v": "2002" }, { "n": "2001", "v": "2001" }, { "n": "2000", "v": "2000" }, { "n": "1999", "v": "1999" }, { "n": "1998", "v": "1998" }, { "n": "1997", "v": "1997" }, { "n": "1996", "v": "1996" }, { "n": "1995", "v": "1995" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "大陆", "v": "大陆" }, { "n": "香港", "v": "香港" }, { "n": "台湾", "v": "台湾" }, { "n": "美国", "v": "美国" }, { "n": "韩国", "v": "韩国" }, { "n": "日本", "v": "日本" }, { "n": "泰国", "v": "泰国" }, { "n": "新加坡", "v": "新加坡" }, { "n": "马来西亚", "v": "马来西亚" }, { "n": "印度", "v": "印度" }, { "n": "英国", "v": "英国" }, { "n": "法国", "v": "法国" }, { "n": "加拿大", "v": "加拿大" }, { "n": "西班牙", "v": "西班牙" }, { "n": "俄罗斯", "v": "俄罗斯" }, { "n": "其它", "v": "其它" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "最新", "v": "time" }, { "n": "人气", "v": "hits" }, { "n": "推荐", "v": "score" }] }]
  },
  filter_url: 'm=vod-list-id-{{fl.分类}}-pg-fypage-order--by-{{fl.排序}}-class--year-{{fl.年代}}-letter--area-{{fl.地区}}-lang-',
  filter_def: { 'dianying': { 分类: '1' }, 'lianxuju': { 分类: '2' }, 'dongman': { 分类: '4' }, 'zongyi': { 分类: '3' } },
  headers: {
    'User-Agent': 'MOBILE_UA',
  },
  timeout: 5000,
  class_parse: '.top-nav li;a&&Text;a&&href;.*/(.*?)/',
  cate_exclude: '最新更新',
  play_parse: true,
  lazy: $js.toString(() => {
    input = { parse: 1, url: input, js: '' };
  }),
  double: true,
  推荐: '.channel-silder-panel;body;h2 a&&title;.channel-silder-img img&&src;.channel-silder-title span&&Text;h2 a&&href',
  一级: '.index-area li;.link-hover&&title;.lazy&&data-original||src;p.other&&Text;.link-hover&&href',  
  二级: {
    title: '.lazy&&alt;dt:eq(2)&&Text',
    img: '.lazy&&data-original||src',
    desc: '.ek.bz&&Text;dd:eq(1)&&Text;dd:eq(0)&&Text;dt:eq(1)&&Text;dt:eq(3)&&Text',
    content: '.ek.js&&Text',
    tabs: '.ek.playfrom li',
    lists: '.ek.videourl:eq(#id)&&a',
    tab_text: 'body&&Text',
    list_text: 'body&&Text',
    list_url: 'a&&href',
    list_url_prefix: '',
  },
  搜索: '*',
}